BOT_TOKEN = "MTE2MjgzNDcwMzYzNjc2Njg5MQ.G8CNDX.7WEftXfFyJluaEBqAzkRSjrp6A7L92WU_vwlmA"  # Your Bot Token
ID_POST = 1227968519547785297  # Your Post ID
USER_ROLES_LIST = ()  # Список ролей пользователя, если необходимо
MAX_ROLES = 100  # Максимальное количество ролей, которые пользователь может иметь

ROLES_LIST = {
    "💙": 1227959634342580385,
    "💚": 1227959710905532530,
    "💛": 1227959730043883652,
    "💜": 1227959756031918122,
    "❤️": 1227959773962436678
}

CHANNEL_ID = 1227956682219454485  # Айди канала, куда будет отправлено приветственное сообщение
