class Messages:
    # Вступительное сообщение
    INTRO_MESSAGE = {
        "title": "🏆 Craft Awards — Голосование за премии года! 🏆",
        "description": (
            "Приветствуем всех участников! 🎉\n\n"
            "Настало время выбрать **лучших из лучших** в нашем сообществе! "
            "**Craft Awards** — это ежегодная премия, где мы определим победителей в самых ярких и значимых номинациях. 🌟\n\n"
            "🔹 **Проголосуй и поддержи своих фаворитов!**\n"
            "Каждый голос важен! Стань частью истории и реши, кто заслуживает звания лучших в этом году! ✨\n\n"
            "🗳️ **Все голосования анонимные**, так что можешь смело выбирать своих героев и творцов!\n\n"
            "⚠️ **Внимание!** Нажав на реакцию **один раз**, ты уже **не сможешь изменить свой голос**. "
            "От каждого участника сервера принимается только **1 голос**!\n\n"
            "🔹 **Для обратной связи или вопросов** пиши **@kapystya**. 📩\n\n"
            "⬇️ **Список номинаций ниже** — выбирай, голосуй и делай этот год незабываемым! 🔥\n\n"
            "**Craft Awards ждёт твоего участия!** ✨"
        )
    }

    # Данные для голосований
    POLL_DATA = [
        {
            "title": "Craft King",
            "description": "Выберите кандидата:",
            "candidates": {
                "🇦": "Kapystya",
                "🇧": "Фекс",
                "🇨": "ExTager"
            },
            "reactions": ['🇦', '🇧', '🇨']
        },
        {
            "title": "Craft Queen",
            "description": "Выберите кандидата:",
            "candidates": {
                "1️⃣": "Yukinesn",
                "2️⃣": "лика",
                "3️⃣": "стелла"
            },
            "reactions": ['1️⃣', '2️⃣', '3️⃣']
        },
        {
            "title": "Лучший геймер",
            "description": "Выберите лучшего геймера:",
            "candidates": {
                "🎮": "PlayerOne",
                "🕹️": "GamerPro",
                "🏆": "LegendaryPlayer"
            },
            "reactions": ['🎮', '🕹️', '🏆']
        }
    ]
