class Messages:
    # Вступительное сообщение
    INTRO_MESSAGE = {
        "title": "🏆 Craft Awards — Голосование за премии года! 🏆",
        "description": (
            "Приветствуем всех участников! 🎉\n\n"
            "Настало время выбрать **лучших из лучших** в нашем сообществе! "
            "**Craft Awards** — это ежегодная премия, где мы определим победителей в самых ярких и значимых номинациях. 🌟\n\n"
            "🔹 **Проголосуй и поддержи своих фаворитов!**\n"
            "Каждый голос важен! Стань частью истории и реши, кто заслуживает звания лучших в этом году! ✨\n\n"
            "🗳️ **Все голосования анонимные**, так что можешь смело выбирать своих героев и творцов!\n\n"
            "⚠️ **Внимание!** Нажав на реакцию **один раз**, ты уже **не сможешь изменить свой голос**. "
            "От каждого участника сервера принимается только **1 голос**!\n\n"
            "🔹 **Для обратной связи или вопросов** пиши **@kapystya**. 📩\n\n"
            "⬇️ **Список номинаций ниже** — выбирай, голосуй и делай этот год незабываемым! 🔥\n\n"
            "**Craft Awards ждёт твоего участия!** ✨"
        )
    }

    # Данные для голосований
    POLL_DATA = [
        {
            "title": "Craft King",
            "description": "Выберите кандидата:",
            "candidates": {
                "🇦": "logik0_332l",
                "🇧": "salpo",
                "🇨": "kripibara",
                "🇩": "maxtytk",
                "🇪": "eugstik",
                "🇫": "kapystya",
                "🇬": "Фэкс",
                "🇭": "MAils5",
                "🇮": "IxTager",
                "🇯": "happy",
                "🇰": "DenMG",
                "🇱": "QWeq_q",
                "🇲": "Fatum",
                "🇳": "Физзаролли",
                "🇴": "KuJin",
                "🇵": "Stepis",
                "🇶": "makaroshkka",
                "🇷": "BlueFlyDog",
                "🇸": "nnekon"
            },
            "reactions": [
                '🇦', '🇧', '🇨', '🇩', '🇪', '🇫', '🇬', '🇭', '🇮', '🇯',
                '🇰', '🇱', '🇲', '🇳', '🇴', '🇵', '🇶', '🇷', '🇸'
            ]
        },
        {
            "title": "Craft Queen",
            "description": "Выберите кандидата:",
            "candidates": {
                "🇦": "yukinesn",
                "🇧": "l0x_2b8",
            },
            "reactions": [
                '🇦', '🇧'
            ]
        },
        {
            "title": "Лучший геймер",
            "description": "Выберите лучшего геймера:",
            "candidates": {
                "🇦": "logik0_332l",
                "🇧": "salpo",
                "🇨": "kripibara",
                "🇩": "maxtytk",
                "🇪": "eugstik",
                "🇫": "kapystya",
                "🇬": "Фэкс",
                "🇭": "MAils5",
                "🇮": "IxTager",
                "🇯": "happy",
                "🇰": "DenMG",
                "🇱": "QWeq_q",
                "🇲": "Fatum",
                "🇳": "nnekon",
                "🇴": "KuJin",
                "🇵": "Stepis",
                "🇶": "makaroshkka",
                "🇷": "BlueFlyDog",
                "🇸": "yukinesn",
                "🇹": "l0x_2b8"
            },
            "reactions": [
                '🇦', '🇧', '🇨', '🇩', '🇪', '🇫', '🇬', '🇭', '🇮', '🇯',
                '🇰', '🇱', '🇲', '🇳', '🇴', '🇵', '🇶', '🇷', '🇸', '🇹'
            ]
        },
        {
            "title": "Мем года",
            "description": "Выберите мем года:",
            "candidates": {
                "🇦": "logik0_332l",
                "🇧": "salpo",
                "🇨": "kripibara",
                "🇩": "maxtytk",
                "🇪": "eugstik",
                "🇫": "kapystya",
                "🇬": "Фэкс",
                "🇭": "MAils5",
                "🇮": "IxTager",
                "🇯": "happy",
                "🇰": "DenMG",
                "🇱": "QWeq_q",
                "🇲": "Fatum",
                "🇳": "nnekon",
                "🇴": "KuJin",
                "🇵": "Stepis",
                "🇶": "makaroshkka",
                "🇷": "BlueFlyDog",
                "🇸": "yukinesn",
                "🇹": "l0x_2b8"
            },
            "reactions": [
                '🇦', '🇧', '🇨', '🇩', '🇪', '🇫', '🇬', '🇭', '🇮', '🇯',
                '🇰', '🇱', '🇲', '🇳', '🇴', '🇵', '🇶', '🇷', '🇸', '🇹'
            ]
        },
        {
            "title": "Фейл года",
            "description": "Выберите фейл года:",
            "candidates": {
                "🇦": "logik0_332l",
                "🇧": "salpo",
                "🇨": "kripibara",
                "🇩": "maxtytk",
                "🇪": "eugstik",
                "🇫": "kapystya",
                "🇬": "Фэкс",
                "🇭": "MAils5",
                "🇮": "IxTager",
                "🇯": "happy",
                "🇰": "DenMG",
                "🇱": "QWeq_q",
                "🇲": "Fatum",
                "🇳": "nnekon",
                "🇴": "KuJin",
                "🇵": "Stepis",
                "🇶": "makaroshkka",
                "🇷": "BlueFlyDog",
                "🇸": "yukinesn",
                "🇹": "l0x_2b8"
            },
            "reactions": [
                '🇦', '🇧', '🇨', '🇩', '🇪', '🇫', '🇬', '🇭', '🇮', '🇯',
                '🇰', '🇱', '🇲', '🇳', '🇴', '🇵', '🇶', '🇷', '🇸', '🇹'
            ]
        },
        {
            "title": "Пара года",
            "description": "Выберите пару года:",
            "candidates": {
                "🇦": "Фекс & кола",
                "🇧": "Стелла(l0x_2b8) & манговое мороженное",
                "🇨": "DenMg & nnekon",
                "🇩": "Salpo & 22",
                "🇪": "kapystya & yukinesn",
                "🇫": "Стелла(l0x_2b8) & Майкл",
                "🇬": "kripibara & maxtytk",
                "🇭": "KuJin & World Of Tanks",
                "🇮": "BlueFlyDog & Мытье полов",
                "🇯": "BlueFlyDog & гойда",
                "🇰": "happy & SoundBar",
                "🇱": "QWeq_q & Пиво"
            },
            "reactions": [
                '🇦', '🇧', '🇨', '🇩', '🇪', '🇫', '🇬', '🇭', '🇮', '🇯',
                '🇰', '🇱'
            ]
        },
        {
            "title": "Аватарка года",
            "description": "Выберите аватарку года:",
            "candidates": {
                "🇦": "logik0_332l",
                "🇧": "salpo",
                "🇨": "kripibara",
                "🇩": "maxtytk",
                "🇪": "eugstik",
                "🇫": "kapystya",
                "🇬": "Фэкс",
                "🇭": "MAils5",
                "🇮": "IxTager",
                "🇯": "happy",
                "🇰": "DenMG",
                "🇱": "QWeq_q",
                "🇲": "Fatum",
                "🇳": "nnekon",
                "🇴": "KuJin",
                "🇵": "Stepis",
                "🇶": "makaroshkka",
                "🇷": "BlueFlyDog",
                "🇸": "yukinesn",
                "🇹": "l0x_2b8"
            },
            "reactions": [
                '🇦', '🇧', '🇨', '🇩', '🇪', '🇫', '🇬', '🇭', '🇮', '🇯',
                '🇰', '🇱', '🇲', '🇳', '🇴', '🇵', '🇶', '🇷', '🇸', '🇹'
            ]
        },
        {
            "title": "Новичок года",
            "description": "Выберите новичка года:",
            "candidates": {
                "🇦": "Фэкс",
                "🇧": "Физзаролли",
                "🇨": "makaroshkka",
                "🇩": "nnekon"
            },
            "reactions": [
                '🇦', '🇧', '🇨', '🇩'
            ]
        },
        {
            "title": "Самый активный участник сервера",
            "description": "Выберите самого активного участника:",
            "candidates": {
                "🇦": "logik0_332l",
                "🇧": "salpo",
                "🇨": "kripibara",
                "🇩": "maxtytk",
                "🇪": "eugstik",
                "🇫": "kapystya",
                "🇬": "Фэкс",
                "🇭": "MAils5",
                "🇮": "IxTager",
                "🇯": "happy",
                "🇰": "DenMG",
                "🇱": "QWeq_q",
                "🇲": "Fatum",
                "🇳": "nnekon",
                "🇴": "KuJin",
                "🇵": "Stepis",
                "🇶": "makaroshkka",
                "🇷": "BlueFlyDog",
                "🇸": "yukinesn",
                "🇹": "l0x_2b8"
            },
            "reactions": [
                '🇦', '🇧', '🇨', '🇩', '🇪', '🇫', '🇬', '🇭', '🇮', '🇯',
                '🇰', '🇱', '🇲', '🇳', '🇴', '🇵', '🇶', '🇷', '🇸', '🇹'
            ]
        },
        {
            "title": "Стример года",
            "description": "Выберите стримера года:",
            "candidates": {
                "🇦": "kapystya",
                "🇧": "eugstik",
                "🇨": "Gav4r",
                "🇩": "QWeq_q",
                "🇪": "Fatum"
            },
            "reactions": [
                '🇦', '🇧', '🇨', '🇩', '🇪'
            ]
        }
    ]


